doc: graph mermaid
